<?php
return [
    /*
    |--------------------------------------------------------------------------
    | 事件配置
    |--------------------------------------------------------------------------
    */

    //添加事件观察者 (监听单个事件)
    'observers' => [
        //数据库: insert
    	'insert'	=>	[],
    	
        //数据库: delete
        'delete'	=>	[],

        //数据库: delete
    	'update'	=>	[],

        //数据库: delete
    	'select'	=>	[],

        //演示
        //'事件名'  =>  [\app\Observers\Demo::class],
    ],

    //添加事件观察者 (监听多个事件)
    'subscribers' => [
        //\app\Subscribers\Demo::class
    ],
];